dgramop/ch554_sdcc/examples/usb_device_cdc/main.c
    }
}
/*******************************************************************************
* Function Name  : Uart1_ISR()
* Description    : The serial port receives the interrupt function to implement circular buffer reception.
*******************************************************************************/
void Uart1_ISR(void) __interrupt (INT_NO_UART1)
{
    if(U1RI)   //Received data
    {
        Receive_Uart_Buf[Uart_Input_Point++] = SBUF1;
        UartByteCount++;                    //Current buffer remaining bytes to be fetched
        if(Uart_Input_Point>=UART_REV_LEN)
            Uart_Input_Point = 0;           //Write pointer
        U1RI =0;
    }

}
//Main function
main()
{
    uint8_t length;
    uint8_t Uart_Timeout = 0;
    CfgFsys( );                                                           //CH559 clock selection configuration
    mDelaymS(5);                                                          //Modify the main frequency and wait for the internal crystal to stabilize.
    mInitSTDIO( );                                                        //Serial port 0, can be used for debugging
    UART1Setup( );                                                        //For CDC

#ifdef DE_PRINTF
    printf("start ...\n");
#endif
    USBDeviceCfg();
    USBDeviceEndPointCfg();                                               //Endpoint configuration
    USBDeviceIntCfg();                                                    //Interrupt initialization
    UEP0_T_LEN = 0;
    UEP1_T_LEN = 0;                                                       //Pre-use send length must be cleared
    UEP2_T_LEN = 0;                                                       //Pre-use send length must be cleared

    while(1)
    {
        if(UsbConfig)
        {
            if(USBByteCount)   //USB receiving endpoint has data
            {
                CH554UART1SendByte(Ep2Buffer[USBBufOutPoint++]);
                USBByteCount--;
                if(USBByteCount==0)
                    UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_R_RES | UEP_R_RES_ACK;

            }
            if(UartByteCount)
                Uart_Timeout++;
            if(!UpPoint2_Busy)   //The endpoint is not busy (the first packet of data after idle, only used to trigger the upload)
            {
                length = UartByteCount;
                if(length>0)
                {
                    if(length>39 || Uart_Timeout>100)
                    {
                        Uart_Timeout = 0;
                        if(Uart_Output_Point+length>UART_REV_LEN)
                            length = UART_REV_LEN-Uart_Output_Point;
                        UartByteCount -= length;
                        //Write upload endpoint
                        memcpy(Ep2Buffer+MAX_PACKET_SIZE,&Receive_Uart_Buf[Uart_Output_Point],length);
                        Uart_Output_Point+=length;
                        if(Uart_Output_Point>=UART_REV_LEN)
                            Uart_Output_Point = 0;
                        UEP2_T_LEN = length;                                                    //Pre-use send length must be cleared
                        UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_ACK;            //Answer ACK
                        UpPoint2_Busy = 1;
                    }
                }
            }
        }
    }
}
